Revit 2016 API
DuctSizeSettingIterator Members
The DuctSizeSettingIterator type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the DuctSizeSettingIterator
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
HasCurrent
 Identifies whether the iterator has a current item. There is no current item if the iterator has not started yet or has been done.
IsDone
 Identifies if the iteration has completed.
MoveNext
 Increments the enumerator to the next item.
Reset
 Resets the iterator to the initial state.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Current
CurrentObject
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DuctSizeSettingIterator Class
Autodesk.Revit.DB.Mechanical Namespace